# Напишите программу, которая принимает на вход координаты двух точек
# и находит расстояние между ними в 2D пространстве.
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21


import math
print('Введите координаты точки A')
x1 = int(input())
y1 = int(input())
A = [x1, y1]
print('Введите координаты точки B')
x2 = int(input())
y2 = int(input())

B = [x2, y2]
distance = math.sqrt( ((A[0]-B[0])**2)+((A[1]-B[1])**2) )
print(distance)